In [1]:
import numpy as np
import pandas as pd

In [9]:
dataFrame = pd.read_excel("maas.xlsx") # exceli okuma

In [4]:
dataFrame

  Unnamed: 0    maas   yas  departman
0     furkan  6000.0  19.0    yazilim
1     mehmet  5000.0   NaN      satis
2        ali     NaN  20.0  pazarlama
3       veli  6500.0  23.0    yazilim

In [5]:
nansizDegerler = dataFrame.dropna()

In [6]:
nansizDegerler

  Unnamed: 0    maas   yas departman
0     furkan  6000.0  19.0   yazilim
3       veli  6500.0  23.0   yazilim

In [8]:
nansizDegerler.to_excel("yenimaaslar.xlsx") # excele kaydetme